# Pandas

In [59]:
import pandas as pd

# Serise (Cul이 한개인거) 데이터자료 2차원

In [60]:
dict_data = {'a':1, 'b':2, 'c':3}
sr = pd.Series(dict_data)

In [61]:
sr

a    1
b    2
c    3
dtype: int64

# DataFrame (Cul이 여러개인거) 데이터자료 2차원

In [62]:
dict_data = {'a':[1, 2, 3], 'b':[4, 5, 6], 'c':[7, 8, 9]}
df = pd.DataFrame(dict_data)

In [63]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [64]:
list_data = ['2022-11-03', 3.14, 'ABC', 100, True]
sr = pd.Series(list_data)

In [65]:
sr

0    2022-11-03
1          3.14
2           ABC
3           100
4          True
dtype: object

In [66]:
sr.index

RangeIndex(start=0, stop=5, step=1)

In [67]:
list(sr.index)

[0, 1, 2, 3, 4]

In [68]:
sr.values

array(['2022-11-03', 3.14, 'ABC', 100, True], dtype=object)

In [69]:
tup_data = ['2022-11-03', 3.14, 'ABC', 100, True]
sr = pd.Series(tup_data, index=['가입일', 'PI', '회사명', '몸무게', '비만여부'])

In [70]:
sr

가입일     2022-11-03
PI            3.14
회사명            ABC
몸무게            100
비만여부          True
dtype: object

In [71]:
sr['몸무게']

100

In [72]:
sr[1:3]

PI     3.14
회사명     ABC
dtype: object

In [73]:
sr['가입일':'몸무게']

가입일    2022-11-03
PI           3.14
회사명           ABC
몸무게           100
dtype: object

In [74]:
df = pd.DataFrame([[15, '남', '영훈중'], [17, '여', '성암중']], index=['서준','도연'], columns=['나이','성별','학교'])

In [75]:
df

    나이 성별   학교
서준  15  남  영훈중
도연  17  여  성암중

In [76]:
df.index

Index(['서준', '도연'], dtype='object')

In [77]:
df.columns

Index(['나이', '성별', '학교'], dtype='object')

In [78]:
df.index = ['학생1', '학생2']
df.columns = ['연령', '남녀', '소속']

In [79]:
df

     연령 남녀   소속
학생1  15  남  영훈중
학생2  17  여  성암중

In [80]:
df1 = df.rename(columns={'연령':'나이'}, inplace=False)

In [81]:
df1

     나이 남녀   소속
학생1  15  남  영훈중
학생2  17  여  성암중

In [82]:
df1 = df.rename(columns={'연령':'나이'}, inplace=True)

In [83]:
print(df1)

None

In [84]:
df

     나이 남녀   소속
학생1  15  남  영훈중
학생2  17  여  성암중

In [85]:
df.rename(index={'학생2':'도연', '학생1':'서준'}, inplace=True)

In [86]:
df

    나이 남녀   소속
서준  15  남  영훈중
도연  17  여  성암중

In [87]:
df.loc['서준',:]  #서준에 대한 정보를 출력

나이     15
남녀      남
소속    영훈중
Name: 서준, dtype: object

In [88]:
df['나이'] #전체 '나이'에 대한 값 출력

서준    15
도연    17
Name: 나이, dtype: int64

In [89]:
df1 = df['나이'] 
df1

서준    15
도연    17
Name: 나이, dtype: int64

In [90]:
type(df1)

pandas.core.series.Series

In [98]:
df1 = df[['나이', '남녀']]
df1

    나이 남녀
서준  15  남
도연  17  여

In [93]:
df1 = df[['나이']]
df1

    나이
서준  15
도연  17

In [97]:
df.loc[['서준', '도연']]

    나이 남녀   소속
서준  15  남  영훈중
도연  17  여  성암중

In [99]:
df.iloc[[0]]  #인덱스 0번 -> 첫번째 행에 대한 정보 출력

    나이 남녀   소속
서준  15  남  영훈중

In [101]:
df.iloc[0, 2] #iolc 첫번째 행의 세번째 열에 대한 정보 출력 / 행열은 행렬로만 입력해야한다

'영훈중'

In [103]:
df.loc['서준', '소속'] #loc은 해당 정보를 직접 대입해서 출력할 때 쓰인다

'영훈중'

In [104]:
dict_data = {'a':[1,2,3], 'b':[4,5,6], 'c':[7,8,9]}
df = pd.DataFrame(dict_data)

In [105]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [106]:
df.loc[0, 'a']

1

In [107]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [108]:
df = pd.DataFrame([[15, '남', '영훈중'], [17, '여', '성암중']], index=['서준','도연'], columns=['나이','성별','학교'])
df

    나이 성별   학교
서준  15  남  영훈중
도연  17  여  성암중

In [109]:
df.iloc[:, 0] # :은 전체를 의미 / 첫번째 열 모두 출력

서준    15
도연    17
Name: 나이, dtype: int64

In [110]:
df.나이[0] #나이에 대한 정보 중에 첫번째 값 출력

15

In [111]:
df['나이'][0] #나이에 대한 정보 중에 첫번째 값 출력

15

In [112]:
df.loc['서준', '나이'] = 22 #서준의 나이를 22로 변경

In [113]:
df

    나이 성별   학교
서준  22  남  영훈중
도연  17  여  성암중

In [114]:
df.loc['서준'] = [18, '남', '보성중'] #서준의 전체 값을 변경

In [115]:
df

    나이 성별   학교
서준  18  남  보성중
도연  17  여  성암중

In [117]:
df.loc['진석'] = [18, '남', '신일중']
df

    나이 성별   학교
서준  18  남  보성중
도연  17  여  성암중
진석  18  남  신일중

In [118]:
df.loc['진서'] = [18, '남', '신일중']
df

    나이 성별   학교
서준  18  남  보성중
도연  17  여  성암중
진석  18  남  신일중
진서  18  남  신일중

In [119]:
df.drop('진서',inplace = True) #drop 함수와 True를 해주면 해당 값을 삭제한다
df

    나이 성별   학교
서준  18  남  보성중
도연  17  여  성암중
진석  18  남  신일중

In [120]:
df.loc['선희'] = [14, '여', '풍문중']
df

    나이 성별   학교
서준  18  남  보성중
도연  17  여  성암중
진석  18  남  신일중
선희  14  여  풍문중

In [121]:
df['키'] = [175, 149, 180, 169] #키에 대한 각각의 열 값이 추가된다
df

    나이 성별   학교    키
서준  18  남  보성중  175
도연  17  여  성암중  149
진석  18  남  신일중  180
선희  14  여  풍문중  169

In [122]:
df['학년'] = 3 # 전체 열에 대해서 학년에 대한 열값이 추가된다
df

    나이 성별   학교    키  학년
서준  18  남  보성중  175   3
도연  17  여  성암중  149   3
진석  18  남  신일중  180   3
선희  14  여  풍문중  169   3